[
  {
    "project_id": 1,
    "file_name": "project_report (1).pdf",
    "project_title": "Aircraft Detection and Classification by Using Satellite Imagery with AI/Ml techniques",
    "student_name": "Raj Rohit",
    "college_name": "Birsa Institute of Technology Sindri",
    "professor_name": "ARAVINDA KUMAR P",
    "technical_domain": "AI/ML",
    "application_domain": "Disaster Management Support",
    "abstract": "Airplane Classification is one of the major problem in point object classification from High Resolution satellite imagery. Satellite images are optical and non opti- cal. Feature extraction from satellite image is more feasible with line features like roadrailways and polygon feature like rivers solar farms etc. At the same time point features like boatairplanes are difficult to extract due to less information to noise ration in sample dataset. Simple model will learn less and put lot of bias for point feature extraction whereas complex model will over train and perform poorly for new dataset. Hence careful analysis of sample images has to be per- formed before putting the dataset for training. Conventional machine learning models and cnn based deep learning models have been explored. Dataset has been gathered from Kaggle which is similar to Bhuvan HR data. Labelling has been done and provided in Json format. A classifier is presented as the result of this exercise. This will act as a framework for point feature classification from High Resolution Satellite imagery.",
    "grade": "N/A"
  },
  {
    "project_id": 2,
    "file_name": "project_report (2).pdf",
    "project_title": "Land Use Land Cover classification and change prediction using Artificial Neural Network in python",
    "student_name": "Dubey Amit Radheshyam",
    "college_name": "Fr. Conceicao Rodrigues College of Engineering",
    "professor_name": "Mr. Hariesh Pesara",
    "technical_domain": "Remote Sensing and GIS",
    "application_domain": "LULC",
    "abstract": "The report summarizes the research and solution of a problem statement given to me during my internship whose objective was to make use of Artificial Neural network and other Machine learning and deep learning methodology to perform Land use land cover (LULC) classification of a multispectral satellite image into various labels and predict the LULC changes. Hence the approach to the problem was divided into 2 stages first being learning the concept of satellite imagery and techniques used to make the LULC maps and the second was to generate a methodology that could make use of the LULC maps as reference and predict the changes that could be seen in the coming future with an acceptable accuracy specifically using Artificial Neural Network. After thorough research and understanding the basics of remote sensing and the properties of a satellite image along with the different types of data that could be accessible and learning various methods in deep learning and machine learning that could be used to achieve the desire application the objectives were achieved.",
    "grade": "N/A"
  },
  {
    "project_id": 3,
    "file_name": "project_report (3).pdf",
    "project_title": "A Project/ Study on Atmospheric Lightning measurements from space and its comparison with ground-based data over India",
    "student_name": "Aman Agarwal",
    "college_name": "Dayalbagh Educational Institute",
    "professor_name": "Dr. Alok Toari",
    "technical_domain": "Data Science / Big Data Analytics",
    "application_domain": "Disaster Management Support",
    "abstract": "Understanding atmospheric lightning flashes and their occurrences is one of the most important aspects of the Earth’s climate science. Real-time lightning data have profound importance in climate science and air-quality research apart from lightning being one of the major natural disasters. Keeping these in view National Remote Sensing Centre (NRSC) Indian Space Research Organization has established a lightning detection sensor (LDS) network for nationwide detection of lightning occurrences with 42 sensors installed until August 2022. Though there is no space borne measurements over India apart from the Lightning Imaging Sensor (LIS) on the International Space Station (ISS) hereafter referred to as ISS-LIS which detects lightning from space by capturing the optical scattered light emitted from the top of the clouds. The objective of this work is to quantify the similarities and deviations between these two distinct lightning detection technologies by comparing the LDS cloud-to-ground flashes to the ISS-LIS measurements. A full month data collected from these two different instruments during April 2020 is assessed for their efficacies and limitations.",
    "grade": "N/A"
  },
  {
    "project_id": 4,
    "file_name": "project_report (4).pdf",
    "project_title": "Study of Remote Sensing Ground Station at NRSC/ISRO",
    "student_name": "Sadhvika Kadari",
    "college_name": "IIT Kharagpur",
    "professor_name": "Dr. A. N. Satyanarayana",
    "technical_domain": "Remote Sensing and GIS",
    "application_domain": "Disaster Management Support",
    "abstract": "The procedure for Satellite Data acquisition system of the Remote Sensing Satellite Ground Station and functioning of various systems required for data acquisition are explained in this report. The Antenna RF Servo Electronics Data Ingest systems and boresight system is studied and focus is laid on the operation procedure. The technical speciﬁcations required for the procedure is mentioned. The daily operations of Real time data acquisition are explained.",
    "grade": "N/A"
  },
  {
    "project_id": 5,
    "file_name": "project_report (5).pdf",
    "project_title": "Characterization of Water Quality and Assessment of Long Term Trends in River Water Quality",
    "student_name": "Anshu Pundir",
    "college_name": "Amity Institute of Environmental Sciences, Amity University, NOIDA, Uttar Pradesh",
    "professor_name": "J Srinivasulu",
    "technical_domain": "Remote Sensing and GIS",
    "application_domain": "Water Resources",
    "abstract": "The Ganga basin is the lifeline of millions of people in India hence it becomes important to study the water quality parameters of these river systems and their long term trends. A detailed characterization of water quality parameters is done using Landsat 8 and Sentinel 2 TOA product as TOA was found to be better suited for studies involving reflectance characterization of water bodies. A Pollution Index (NIR – Red) / (NIR + Red) is suggested for studying long term trend of pollution. It has been found that Pollution Index should be avoided in river waters with high turbidity as NIR has shown some sensitivity towards turbidity as well. A Modified Normalized Difference Turbidity Index (MNDTI (B4 – B2) / (B4 + B2)) is suggested as it has shown to have a higher positive correlation with turbidity (r = 0.55) and a higher negative correlation with TDS (r = - 0.41) compared to the traditional NDTI which had r values of 0.51 and - 0.31 with turbidity and TDS respectively. Average visible reflectance is suggested for studying turbidity trends especially in highly polluted waters where the conventional NDTI and the MNDTI have shown errors. Based on the findings the long term trend of Yamuna at Vishramghat Mathura Ganga at Jajmau Kanpur and Hindon at Nagwa UP was carried out. Yamuna at Vishramghat has shown an increase in pollution from 1989 till 2010 and a stable trend from thereon turbidity on the other hand has continuously increased from 1989 till 2019 indicating either an increase in soil erosion or increase in organic sediment load in the river water. The Pollution Index has shown positive values from 2005 onwards with values remaining below 0.05. The Pollution Index value of Ganga at Jajmau Kanpur never showed positive values and has shown a sudden improvement in water quality after 2019 while the turbidity in the river has remained more or less the same in 2021 compared to 1988. Hindon water at Nagwa is highly polluted. In the long term Hindon at Nagwa has shown a deterioration in water quality in terms of both pollution and turbidity compared to 1989. The pollution Index value is as high as 0.34 in 2019.",
    "grade": "N/A"
  },
  {
    "filename": "project_report (6).pdf",
    "Project Title": "DESIGN AND FABRICATION OF A BIOMIMETIC REMOTELY OPERATED UNDERWATER VEHICLE (ROV)",
    "Student Name": "SASIDHAR.V, SATHISH KUMAR.J, DINESH.R, DINESH KUMAR.G",
    "College Name": "Dr. M.G.R. Educational and Research Institute",
    "Professor Name": "Dr.N. ETHIRAJ",
    "Technical Domain": "Robotics",
    "Application Domain": "Geosciences",
    "abstract": "This project presents the design and fabrication of a biomimetic Remotely Operated Underwater Vehicle (ROV) inspired by marine life. The primary goal of the project is to develop a functional underwater ROV capable of performing tasks such as surveillance environmental monitoring and exploration. The initial phase of the project involved studying different marine creatures to find a suitable body design that would support the placement of mechanical and electronic components efficiently. After analyzing options like fish dolphin and squid the turtle structure was selected for its simple body profile practical component accommodation and ease of assembly. The actual design phase included detailed three-dimensional modeling which ensured organized placement of motors sensors camera electronics and power supply inside the ROV body. A thorough study of various thruster configurations such as Plus (+) Star T and Parallel was conducted. Based on movement requirements and design simplicity the X-configuration was selected. In this arrangement four motors were positioned symmetrically around the ROV allowing it to move upward downward sideways and rotate by controlling the combination of motor movements. The ROV is operated using a transmitter and receiver communication system. The receiver is positioned above water and connected to the onboard ESP32 microcontroller through a wired link to ensure stable command reception. The system is designed for one-way control communication where the operator sends commands to the ROV but no live data or video feed is transmitted back during underwater operation. To support navigation and monitoring an ultrasonic sensor is mounted externally on the ROV to detect obstacles and a pressure sensor is installed inside the body to monitor internal pressure changes. Both sensor outputs are stored within the ROV’s onboard memory for later retrieval and analysis. Additionally a wireless camera is fixed on the top-mounted camera holder. The camera records underwater footage during the mission and stores the video internally which can be reviewed after the ROV is brought back to the surface. The construction of the ROV involves assembling 3D-printed parts and sealing them using M-Seal and silicone glue ensuring water resistance without using screws or bolts. This approach simplifies the waterproofing process while maintaining structural integrity. The project emphasizes organized internal wiring easy maintenance access through the removable lid and careful placement of all components for efficient operation. This ROV design offers a simple effective solution for underwater tasks where real-time data transmission is not required. Future work will focus on improving system durability refining underwater movement and incorporating more advanced onboard data storage and processing capabilities.",
    "project_id": 6
  },
  {
    "filename": "project_report (7).pdf",
    "Project Title": "DESIGN AND FABRICATION OF A BIOMIMETIC REMOTELY OPERATED UNDERWATER VEHICLE (ROV)",
    "Student Name": "SASIDHAR.V, SATHISH KUMAR.J, DINESH.R, DINESH KUMAR.G",
    "College Name": "Dr. M.G.R. Educational and Research Institute UNIVERSITY",
    "Professor Name": "Dr.N. ETHIRAJ",
    "Technical Domain": "Robotics",
    "Application Domain": "Water Resources",
    "abstract": "This project presents the design and fabrication of a biomimetic Remotely Operated Underwater Vehicle (ROV) inspired by marine life. The primary goal of the project is to develop a functional underwater ROV capable of performing tasks such as surveillance environmental monitoring and exploration. The initial phase of the project involved studying different marine creatures to find a suitable body design that would support the placement of mechanical and electronic components efficiently. After analyzing options like fish dolphin and squid the turtle structure was selected for its simple body profile practical component accommodation and ease of assembly. The actual design phase included detailed three-dimensional modeling which ensured organized placement of motors sensors camera electronics and power supply inside the ROV body. A thorough study of various thruster configurations such as Plus (+) Star T and Parallel was conducted. Based on movement requirements and design simplicity the X-configuration was selected. In this arrangement four motors were positioned symmetrically around the ROV allowing it to move upward downward sideways and rotate by controlling the combination of motor movements. The ROV is operated using a transmitter and receiver communication system. The receiver is positioned above water and connected to the onboard ESP32 microcontroller through a wired link to ensure stable command reception. The system is designed for one-way control communication where the operator sends commands to the ROV but no live data or video feed is transmitted back during underwater operation. To support navigation and monitoring an ultrasonic sensor is mounted externally on the ROV to detect obstacles and a pressure sensor is installed inside the body to monitor internal pressure changes. Both sensor outputs are stored within the ROV’s onboard memory for later retrieval and analysis. Additionally a wireless camera is fixed on the top-mounted camera holder. The camera records underwater footage during the mission and stores the video internally which can be reviewed after the ROV is brought back to the surface. The construction of the ROV involves assembling 3D-printed parts and sealing them using M-Seal and silicone glue ensuring water resistance without using screws or bolts. This approach simplifies the waterproofing process while maintaining structural integrity. The project emphasizes organized internal wiring easy maintenance access through the removable lid and careful placement of all components for efficient operation. This ROV design offers a simple effective solution for underwater tasks where real-time data transmission is not required. Future work will focus on improving system durability refining underwater movement and incorporating more advanced onboard data storage and processing capabilities.",
    "project_id": 7
  }
]